[
  {
    "id": 1,
    "name": "Soraka",
    "role": "Support",
    "image": "soraka.png",
    "title": "The Starchild",
    "race": "Celestial",
    "damageType": "Magic",
    "relationships": null,
    "location": "Targon",
    "legacyType": "Enchanter",
    "rangeType": "Ranged",
    "rangeDistance": "550",
    "age": null,
    "bio": "A benevolent celestial being who sacrificed her immortality to heal the suffering of mortals, Soraka remains a beacon of compassion and hope in Runeterra. She wields the power of the stars to mend wounds and silence those who seek to cause harm.",
    "qAbility": "Starcall",
    "qAbilityDescription": "Soraka calls down a star, dealing magic damage and slowing enemies in an area. If it hits an enemy champion, Soraka gains a heal over time and bonus movement speed.",
    "wAbility": "Astral Infusion",
    "wAbilityDescription": "Soraka restores health to a target allied champion, at the cost of a portion of her own health. This ability cannot be cast if Soraka's health is too low.",
    "eAbility": "Equinox",
    "eAbilityDescription": "Soraka creates a zone that silences enemies standing within it. After a short delay, the zone explodes, rooting enemies still inside.",
    "ultimateAbility": "Wish",
    "ultimateAbilityDescription": "Soraka calls upon the stars to heal all allied champions across the map, regardless of their location.",
    "passive": "Salvation",
    "passiveDescription": "Soraka gains bonus movement speed when moving towards low health allied champions."
  },
  {
    "id": 2,
    "name": "Swain",
    "role": "Support, Mid Lane, Top Lane",
    "image": "swain.png",
    "title": "The Noxian Grand General",
    "race": "Human (with demonic power)",
    "damageType": "Magic",
    "relationships": "Darius (loyal general), LeBlanc (rival)",
    "location": "Noxus",
    "legacyType": "Mage, Battlemage",
    "rangeType": "Ranged",
    "rangeDistance": "550",
    "age": null,
    "bio": "Jericho Swain is the visionary ruler of Noxus, a master strategist who sacrifices his own body for greater power. Though he lost an arm to Ionian magic, he now commands a demonic entity, using its power to crush his enemies and strengthen the empire.",
    "qAbility": "Death's Hand",
    "qAbilityDescription": "Swain unleashes five bolts of eldritch power in a cone, dealing magic damage to enemies. Enemies hit by multiple bolts take reduced damage. Each bolt that kills a unit restores mana.",
    "wAbility": "Vision of Empire",
    "wAbilityDescription": "Swain conjures a demonic eye that reveals and damages enemies in a large area after a short delay. Enemy champions hit are also slowed.",
    "eAbility": "Nevermove",
    "eAbilityDescription": "Swain launches a demonic hand that returns to him after a short delay. Enemies hit on either the way out or the way back are rooted and dealt magic damage.",
    "ultimateAbility": "Demonic Ascension",
    "ultimateAbilityDescription": "Swain transforms into a demon, gaining bonus health and continuously draining the health of nearby enemies. He can reactivate the ability to unleash a burst of demonic energy, dealing magic damage based on health drained and exploding nearby soul fragments.",
    "passive": "Ravenous Flock",
    "passiveDescription": "Enemy champions killed by Swain, or immobilized by his abilities, drop Soul Fragments. Swain can collect these to restore health and permanently increase his maximum health. Swain's demon also periodically pulls in Soul Fragments from nearby dead units."
  },
  {
    "id": 3,
    "name": "Syndra",
    "role": "Mid Lane",
    "image": "syndra.png",
    "title": "The Dark Sovereign",
    "race": "Human",
    "damageType": "Magic",
    "relationships": "Zed (rival)",
    "location": "Ionia",
    "legacyType": "Mage, Burst",
    "rangeType": "Ranged",
    "rangeDistance": "800",
    "age": null,
    "bio": "Syndra is a fearsome Ionian mage with immense, uncontrolled power. She wields dark orbs of raw magic, fueled by her desire to dominate and her refusal to be constrained by anyone, least of all those who seek to control her.",
    "qAbility": "Dark Sphere",
    "qAbilityDescription": "Syndra conjures an untargetable Dark Sphere at a target location, dealing magic damage to nearby enemies. Dark Spheres can be manipulated by her other abilities.",
    "wAbility": "Force of Will",
    "wAbilityDescription": "Syndra picks up a target Dark Sphere, enemy minion, or monster. She can then throw it to a target location, dealing magic damage and slowing enemies in the area. Sphere picks up any other spheres it passes through.",
    "eAbility": "Scatter the Weak",
    "eAbilityDescription": "Syndra unleashes a wave of dark energy, dealing magic damage to enemies in a cone and knocking them back. Dark Spheres caught in the wave also travel forward, stunning enemies they hit.",
    "ultimateAbility": "Unleashed Power",
    "ultimateAbilityDescription": "Syndra unleashes a torrent of magical energy, launching all her active Dark Spheres at a target enemy champion. Each sphere deals magic damage.",
    "passive": "Transcendent",
    "passiveDescription": "Syndra's abilities are enhanced at max rank, granting them additional effects."
  },
  {
    "id": 4,
    "name": "Tahm Kench",
    "role": "Support, Top Lane",
    "image": "tahmkench.png",
    "title": "The River King",
    "race": "Demon",
    "damageType": "Magic",
    "relationships": null,
    "location": "Runeterra (wandering)",
    "legacyType": "Tank, Warden",
    "rangeType": "Melee",
    "rangeDistance": "175",
    "age": null,
    "bio": "Tahm Kench is a colossal, demonic catfish who roams the rivers of Runeterra, making bargains with unsuspecting mortals. He offers swift solutions to desperate problems, but always at a steep price that ends with him devouring his victims.",
    "qAbility": "Tongue Lash",
    "qAbilityDescription": "Tahm Kench lashes out with his tongue, dealing magic damage and slowing the first enemy hit. If the target has 3 stacks of 'An Acquired Taste,' they are stunned.",
    "wAbility": "Abyssal Dive",
    "wAbilityDescription": "Tahm Kench dives into the ground and re-emerges at a target location, dealing magic damage and knocking up enemies.",
    "eAbility": "Thick Skin",
    "eAbilityDescription": "Tahm Kench converts a portion of damage he takes into grey health. He can activate this ability to shield himself with his grey health.",
    "ultimateAbility": "Devour",
    "ultimateAbilityDescription": "Tahm Kench devours a target allied champion, making them untargetable. He can then move with them in his belly for a short duration. He can reactivate the ability to spit them out. Alternatively, he can devour an enemy champion (if they have 3 stacks of 'An Acquired Taste'), rendering them untargetable and dealing massive magic damage.",
    "passive": "An Acquired Taste",
    "passiveDescription": "Tahm Kench's basic attacks and abilities apply stacks of 'An Acquired Taste.' Upon reaching 3 stacks, his Tongue Lash and Devour abilities gain bonus effects."
  },
  {
    "id": 5,
    "name": "Taliyah",
    "role": "Mid Lane, Jungle",
    "image": "taliyah.png",
    "title": "The Stoneweaver",
    "race": "Human (Shuriman, Mage)",
    "damageType": "Magic",
    "relationships": "Yasuo (mentor)",
    "location": "Shurima",
    "legacyType": "Mage, Burst",
    "rangeType": "Ranged",
    "rangeDistance": "525",
    "age": null,
    "bio": "Taliyah is a nomadic mage from Shurima, who uses her mastery over stone to shape the battlefield. She seeks to find her place in the world and defend her people, constantly learning to control her volatile powers.",
    "qAbility": "Threaded Volley",
    "qAbilityDescription": "Taliyah throws a volley of five stones in a target direction, dealing magic damage in an area. Subsequent stones hit on the same target deal reduced damage. Casting on 'Worked Ground' consumes less mana and throws only one powerful stone.",
    "wAbility": "Seismic Shove",
    "wAbilityDescription": "Taliyah marks a target area. After a short delay, she erupts the ground, knocking up and dealing magic damage to enemies. She can reactivate to direct the shove in a specific direction.",
    "eAbility": "Unraveled Earth",
    "eAbilityDescription": "Taliyah scatters an array of unstable rocks on the ground that slow and deal magic damage to enemies who dash or are knocked through them. After a few seconds, the rocks explode, dealing additional magic damage.",
    "ultimateAbility": "Weaver's Wall",
    "ultimateAbilityDescription": "Taliyah summons a massive, long-lasting wall of rock that extends across the map. She can reactivate the ability to ride the wall, allowing her to traverse great distances.",
    "passive": "Rock Surfing",
    "passiveDescription": "When out of combat and near walls, Taliyah gains bonus movement speed."
  },
  {
    "id": 6,
    "name": "Talon",
    "role": "Mid Lane, Jungle",
    "image": "talon.png",
    "title": "The Blade's Shadow",
    "race": "Human",
    "damageType": "Physical",
    "relationships": "Du Couteau family (master), Katarina (colleague)",
    "location": "Noxus",
    "legacyType": "Assassin",
    "rangeType": "Melee",
    "rangeDistance": "125",
    "age": null,
    "bio": "Talon is a brutal assassin and the loyal blade of the Du Couteau family in Noxus. He operates from the shadows, dispatching his targets with swift and deadly precision, leaving no trace behind but a lingering fear.",
    "qAbility": "Noxian Diplomacy",
    "qAbilityDescription": "Talon stabs a target enemy, dealing physical damage. If cast at melee range, it deals critical damage. If cast at range, Talon leaps to the target before stabbing them. If this kills a unit, Talon gains a small heal and refunds part of the cooldown.",
    "wAbility": "Rake",
    "wAbilityDescription": "Talon throws out a cone of daggers that deal physical damage and return to him, dealing additional physical damage and slowing enemies they pass through.",
    "eAbility": "Assassin's Path",
    "eAbilityDescription": "Talon vaults over any terrain or structure. This ability has a cooldown on each individual piece of terrain.",
    "ultimateAbility": "Shadow Assault",
    "ultimateAbilityDescription": "Talon disperses a ring of blades around him, becoming camouflaged and gaining movement speed. When he reactivates the ability or basic attacks, the blades converge on his target, dealing physical damage.",
    "passive": "Blade's End",
    "passiveDescription": "Talon's abilities wound enemy champions. After 3 wounds, his basic attacks against that champion cause them to bleed, dealing physical damage over time."
  },
  {
    "id": 7,
    "name": "Taric",
    "role": "Support",
    "image": "taric.png",
    "title": "The Shield of Valoran",
    "race": "Human (Aspect)",
    "damageType": "Magic",
    "relationships": "Aspect of the Protector",
    "location": "Targon",
    "legacyType": "Tank, Enchanter",
    "rangeType": "Melee",
    "rangeDistance": "150",
    "age": null,
    "bio": "Taric is the Aspect of the Protector, a radiant guardian who defends life, beauty, and love on Runeterra. Clad in gleaming armor and wielding crystalline power, he fights with unwavering resolve against the corrupting forces of the Void.",
    "qAbility": "Starlight's Touch",
    "qAbilityDescription": "Taric expends charges to heal himself and nearby allies. Basic attacks reduce the cooldown of this ability.",
    "wAbility": "Bastion",
    "wAbilityDescription": "Taric tethers himself to an allied champion, granting them a portion of his armor and magic resist. He can cast his abilities from their location.",
    "eAbility": "Dazzle",
    "eAbilityDescription": "Taric fires a burst of starlight in a line, stunning and dealing magic damage to all enemies hit after a short delay.",
    "ultimateAbility": "Cosmic Radiance",
    "ultimateAbilityDescription": "After a short delay, Taric blesses himself and all nearby allied champions with invulnerability for a brief duration.",
    "passive": "Bravado",
    "passiveDescription": "After casting an ability, Taric's next two basic attacks deal bonus magic damage, gain bonus attack speed, and reduce the cooldown of his basic abilities."
  },
  {
    "id": 8,
    "name": "Teemo",
    "role": "Top Lane, Mid Lane",
    "image": "teemo.png",
    "title": "The Swift Scout",
    "race": "Yordle",
    "damageType": "Mixed (Physical and Magic)",
    "relationships": null,
    "location": "Bandle City",
    "legacyType": "Marksman, Assassin",
    "rangeType": "Ranged",
    "rangeDistance": "500",
    "age": null,
    "bio": "Teemo is a scout from Bandle City, known for his relentless enthusiasm and deadly efficiency. He roams the lands as a stealthy, toxic warrior, planting poisonous traps and blinding his foes with darts.",
    "qAbility": "Blinding Dart",
    "qAbilityDescription": "Teemo fires a dart that deals magic damage and blinds a target enemy for a short duration, causing their basic attacks to miss.",
    "wAbility": "Move Quick",
    "wAbilityDescription": "Teemo gains bonus movement speed for a short duration. This bonus is lost if he takes damage from an enemy champion or turret.",
    "eAbility": "Toxic Shot",
    "eAbilityDescription": "Passive: Teemo's basic attacks deal bonus magic damage over time. Active: N/A",
    "ultimateAbility": "Noxious Trap",
    "ultimateAbilityDescription": "Teemo plants a stealthy mushroom that detonates when an enemy steps on it, dealing magic damage over time and slowing enemies in the area. Mushrooms last for a long duration.",
    "passive": "Guerrilla Warfare",
    "passiveDescription": "If Teemo stands still for a short duration, he enters camouflage. While in brush, he remains camouflaged indefinitely and can move without breaking stealth."
  },
  {
    "id": 9,
    "name": "Thresh",
    "role": "Support",
    "image": "thresh.png",
    "title": "The Chain Warden",
    "race": "Wraith",
    "damageType": "Magic",
    "relationships": "Senna (former prisoner)",
    "location": "Shadow Isles",
    "legacyType": "Catcher, Warden",
    "rangeType": "Ranged",
    "rangeDistance": "450",
    "age": null,
    "bio": "Thresh is a sadistic, spectral jailer from the Shadow Isles, who collects the souls of his victims for his twisted amusement. He wields a cruel scythe and arcane chains, dragging souls to his lantern for an eternity of torment.",
    "qAbility": "Death Sentence",
    "qAbilityDescription": "Thresh throws his scythe, hooking the first enemy hit, dealing magic damage, and pulling them towards him. He can reactivate the ability to dash to the hooked target.",
    "wAbility": "Dark Passage",
    "wAbilityDescription": "Thresh throws his lantern to a target location. If an allied champion clicks the lantern, they are pulled to Thresh's location. Thresh gains a shield and shields any allied champion who takes the lantern.",
    "eAbility": "Flay",
    "eAbilityDescription": "Passive: Thresh's basic attacks deal bonus magic damage based on the souls he has collected. Active: Thresh sweeps his chain, dealing magic damage to enemies in a line and knocking them in the direction of the sweep.",
    "ultimateAbility": "The Box",
    "ultimateAbilityDescription": "Thresh summons a prison of spectral walls around him. Enemies who break a wall take magic damage and are heavily slowed. Subsequent walls broken deal half damage and no slow.",
    "passive": "Damnation",
    "passiveDescription": "Thresh collects the souls of dead enemies, which permanently grant him bonus armor and ability power."
  },
  {
    "id": 10,
    "name": "Tristana",
    "role": "Bot Lane (ADC), Mid Lane",
    "image": "tristana.png",
    "title": "The Yordle Gunner",
    "race": "Yordle",
    "damageType": "Physical",
    "relationships": "Rumble (friend)",
    "location": "Bandle City",
    "legacyType": "Marksman, Assassin",
    "rangeType": "Ranged",
    "rangeDistance": "525",
    "age": null,
    "bio": "Tristana is a fearless yordle gunner who dreams of adventure and explosive battles. Wielding her trusty cannon, Boomer, she leaps into the fray, eager to take down the biggest targets and prove her bravery.",
    "qAbility": "Rapid Fire",
    "qAbilityDescription": "Tristana rapidly increases her attack speed for a few seconds.",
    "wAbility": "Rocket Jump",
    "wAbilityDescription": "Tristana leaps to a target location, dealing magic damage and slowing enemies upon landing. Reset on kill or assist, or by fully stacking 'Explosive Charge' on a champion.",
    "eAbility": "Explosive Charge",
    "eAbilityDescription": "Tristana attaches an explosive charge to an enemy or turret. After a short delay, it explodes, dealing physical damage to nearby enemies. Basic attacks against the target increase the explosion's damage.",
    "ultimateAbility": "Buster Shot",
    "ultimateAbilityDescription": "Tristana fires a massive cannonball at a target enemy, dealing magic damage and knocking them back a great distance.",
    "passive": "Draw a Bead",
    "passiveDescription": "Tristana's attack range permanently increases as she levels up."
  },
  {
    "id": 11,
    "name": "Trundle",
    "role": "Jungle, Top Lane",
    "image": "trundle.png",
    "title": "The Troll King",
    "race": "Troll",
    "damageType": "Physical",
    "relationships": "Lissandra (enemy)",
    "location": "Freljord",
    "legacyType": "Fighter, Tank",
    "rangeType": "Melee",
    "rangeDistance": "125",
    "age": null,
    "bio": "Trundle is a mischievous and brutal troll chieftain who rose to power by outsmarting and out-brawling his rivals. He wields a mighty True Ice club and thrives in chaos, leaving a trail of broken promises and broken bones.",
    "qAbility": "Chomp",
    "qAbilityDescription": "Trundle bites his target, dealing physical damage and stealing a portion of their attack damage for a short duration.",
    "wAbility": "Frozen Domain",
    "wAbilityDescription": "Trundle creates a zone of frozen ground, gaining bonus attack speed, movement speed, and increased healing from all sources while standing within it.",
    "eAbility": "Pillar of Ice",
    "eAbilityDescription": "Trundle summons a pillar of ice at a target location, acting as impassable terrain and slowing nearby enemies.",
    "ultimateAbility": "Subjugate",
    "ultimateAbilityDescription": "Trundle drains the life force from a target enemy champion, dealing magic damage over time and stealing a percentage of their health, armor, and magic resist. He gains these stolen stats for the duration.",
    "passive": "King's Tribute",
    "passiveDescription": "When a nearby enemy unit dies, Trundle heals for a portion of its maximum health."
  },
  {
    "id": 12,
    "name": "Tryndamere",
    "role": "Top Lane",
    "image": "tryndamere.png",
    "title": "The Barbarian King",
    "race": "Human",
    "damageType": "Physical",
    "relationships": "Ashe (wife)",
    "location": "Freljord",
    "legacyType": "Fighter, Skirmisher",
    "rangeType": "Melee",
    "rangeDistance": "125",
    "age": null,
    "bio": "Driven by an insatiable rage and the will to survive, Tryndamere is the king of the Avarosan tribe in the Freljord. He seeks vengeance against the forces that massacred his people, and his sheer fury allows him to defy death itself.",
    "qAbility": "Bloodlust",
    "qAbilityDescription": "Passive: Tryndamere gains bonus attack damage for each point of Fury he has. Active: Tryndamere consumes all his Fury to heal himself, with the heal increasing based on how much Fury he consumes.",
    "wAbility": "Mocking Shout",
    "wAbilityDescription": "Tryndamere lets out a taunt, reducing the attack damage of nearby enemies. Enemies facing away from him are slowed.",
    "eAbility": "Spinning Slash",
    "eAbilityDescription": "Tryndamere spins his sword, dashing to a target location and dealing physical damage to enemies in his path. The cooldown of this ability is reduced when he critically strikes.",
    "ultimateAbility": "Undying Rage",
    "ultimateAbilityDescription": "Tryndamere becomes immune to death for a few seconds, preventing his health from dropping below 1. He cannot be killed during this duration.",
    "passive": "Battle Fury",
    "passiveDescription": "Tryndamere gains Fury with each basic attack and critical strike. Fury grants him bonus critical strike chance."
  },
  {
    "id": 13,
    "name": "Twisted Fate",
    "role": "Mid Lane",
    "image": "twistedfate.png",
    "title": "The Card Master",
    "race": "Human",
    "damageType": "Magic",
    "relationships": "Graves (rival, former partner), Miss Fortune (ally)",
    "location": "Bilgewater",
    "legacyType": "Mage, Burst",
    "rangeType": "Ranged",
    "rangeDistance": "525",
    "age": null,
    "bio": "Twisted Fate is a notorious card sharp and rogue from Bilgewater, known for his cunning intellect and mastery of arcane cards. He uses his magical abilities to cheat fate, manipulate chance, and always come out on top.",
    "qAbility": "Wild Cards",
    "qAbilityDescription": "Twisted Fate throws three cards in a cone, each dealing magic damage to enemies they pass through.",
    "wAbility": "Pick a Card",
    "wAbilityDescription": "Twisted Fate shuffles through three different colored cards, which he can then pick to empower his next basic attack with different effects: Blue Card (mana restore and high damage), Red Card (area-of-effect damage and slow), or Gold Card (stun).",
    "eAbility": "Stacked Deck",
    "eAbilityDescription": "Passive: Every fourth basic attack, Twisted Fate deals bonus magic damage. Active: N/A",
    "ultimateAbility": "Destiny / Gate",
    "ultimateAbilityDescription": "First Cast: Twisted Fate reveals all enemy champions on the map for a short duration. Second Cast (within the duration): Twisted Fate teleports to a target location within range.",
    "passive": "Loaded Dice",
    "passiveDescription": "Twisted Fate gains bonus gold when he kills a minion or monster."
  }
]